etc/OpenFOAM_Sample_Files/outdoor_0/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 2.8; // wind velocity
Zref                 10;	// reference z value
z0                   uniform 1; // roughness
flowDir              (0 1 0); // velocity vector
zDir				 (0 0 1); // z direction (0 0 1) always for our cases
zGround              uniform 0; //min z value of the bounding box
// ************************************************************************* //
