etc/OpenFOAM_Sample_Files/outdoor_0/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 2.8;
Href                 15;
z0                   uniform 1;
turbulentKE          0.5;
windDirection        (0 1 0);
zDirection           (0 0 1);
zGround              uniform 0;
// ************************************************************************* //
