etc/OpenFOAM_Sample_Files/outdoor_0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
		value    		uniform $pressure;
    }

	walls
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }
	
	top
	{
		type		slip;
	}
	
	rightSide
	{
		type		slip;
	}

	leftSide
	{
		type		slip;
	}
}

// ************************************************************************* //
